perftests/gojson/run1.log
hey -z 30s -m GET -cpus 4 -c 200 -H "Authorization: icandowhatiwant" http://localhost:9000/performance

Summary:
  Total:	30.0025 secs
  Slowest:	0.0373 secs
  Fastest:	0.0000 secs
  Average:	0.0060 secs
  Requests/sec:	63601.0865
  
  Total data:	227069850 bytes
  Size/request:	227 bytes

Response time histogram:
  0.000 [1]	|
  0.004 [692187]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.007 [247445]	|■■■■■■■■■■■■■■
  0.011 [47005]	|■■■
  0.015 [10005]	|■
  0.019 [2358]	|
  0.022 [564]	|
  0.026 [178]	|
  0.030 [100]	|
  0.034 [149]	|
  0.037 [8]	|


Latency distribution:
  10% in 0.0001 secs
  25% in 0.0014 secs
  50% in 0.0028 secs
  75% in 0.0044 secs
  90% in 0.0062 secs
  95% in 0.0080 secs
  99% in 0.0119 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0373 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0075 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0211 secs
  resp wait:	0.0058 secs, 0.0000 secs, 0.0373 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0295 secs

Status code distribution:
  [400]	1000000 responses

Error distribution:
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:51577->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:51578->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:51579->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:51582->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:51584->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:51591->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:51600->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:51603->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:51604->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:51605->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:51606->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:51607->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:51608->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:51609->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:51610->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:51611->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:51612->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:51613->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:51614->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:51615->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:51616->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:51617->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:51618->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:51619->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:51620->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:51621->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:51622->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:51623->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:51624->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:51625->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:51626->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:51627->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:51628->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:51629->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:51630->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:51631->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:51632->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:51633->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp 127.0.0.1:51634->127.0.0.1:9000: read: connection reset by peer