perftests/gojson/smol-run2.log
hey -z 30s -m GET -cpus 4 -c 200 http://localhost:9000/smol-perf

Summary:
  Total:	30.0008 secs
  Slowest:	0.2625 secs
  Fastest:	0.0000 secs
  Average:	0.0060 secs
  Requests/sec:	57425.8480
  
  Total data:	65465108 bytes
  Size/request:	65 bytes

Response time histogram:
  0.000 [1]	|
  0.026 [987986]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.053 [9705]	|
  0.079 [1180]	|
  0.105 [120]	|
  0.131 [207]	|
  0.157 [0]	|
  0.184 [210]	|
  0.210 [200]	|
  0.236 [191]	|
  0.262 [200]	|


Latency distribution:
  10% in 0.0012 secs
  25% in 0.0017 secs
  50% in 0.0028 secs
  75% in 0.0046 secs
  90% in 0.0081 secs
  95% in 0.0108 secs
  99% in 0.0285 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.2625 secs
  DNS-lookup:	0.0006 secs, 0.0000 secs, 0.2238 secs
  req write:	0.0000 secs, 0.0000 secs, 0.1864 secs
  resp wait:	0.0052 secs, 0.0000 secs, 0.2608 secs
  resp read:	0.0002 secs, 0.0000 secs, 0.2239 secs

Status code distribution:
  [200]	1000000 responses

Error distribution:
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:53375->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:53378->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:53380->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:53381->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:53382->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:53383->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:53384->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:53385->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:53386->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:53387->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:53388->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:53389->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:53390->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:53391->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:53392->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:53393->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:53394->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:53395->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:53396->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:53397->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:53398->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:53399->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:53400->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:53401->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:53402->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:53403->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:53404->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:53405->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:53406->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:53407->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:53408->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:53409->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:53410->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:53411->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:53412->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:53413->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:53416->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:53417->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:53419->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:53420->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:53423->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:53425->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:53426->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:53427->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:53428->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:53429->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:53430->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:53431->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:53432->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:53433->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:53435->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:53436->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:53437->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:53439->127.0.0.1:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/smol-perf": read tcp 127.0.0.1:53440->127.0.0.1:9000: read: connection reset by peer